{"text": "# Ethereum ICO Workshop\n\nLearn how to deploy your own token/coin on Ethereum\n\n## Prerequisites\n\n* Install [MetaMask] Web browser extension\n* Create a wallet using MetaMask\n\n> Basic programming knowledge is expected to follow this workshop\n\n## Ethereum\n\n### Basic explanation of Distributed Systems\n\nWith most websites, information is stored on a server, which is basically just a computer \nwith a database in it that has all of the site's information. If that computer is damaged, \nall the data and the website is gone. With distributed ledger technology, a database is \ndistributed among a great number of people's computers, so that all information in the \ndatabase is public and the database can't really be shut down as long as computers are \nstill contributing to it.\n\n### Distributed ledger\n\nYou can think of a distributed ledger as a shared Excel spreadsheet. Ledger is nothing else but a store of somehow organised information that could be financial transactions or events, but potentially anything else that you can categorise.\n\n### Consensus\n\nConsesus is a way of agreeing on the latest version of distributed ledger (or our shared spreadsheet) amongst participants - what updates are valid, and what is the order of those updates.\n\nIn blockchain technology, ledger updates are called transactions, and they are grouped in blocks to achieve consensus in a more efficient manner. Once a block is agreed upon and consensus has been reached, it becomes immutable and can never be changed. Blocks are stacked in a chain and together they contain a full history of all transactions.\n\n### Smart Contracts (Ethereum)\n\nSmart contracts are just like functions or macros in a spreadsheet. You can use them to manage more complex operations and updates on entries in your ledger. You're able to execute those functions in a distributed manner, making Ethereum more advanced than for example Bitcoin, that supports only basic transactions.\n\n### Ether Gas\n\nGas is a price you pay in Ether (Ethereum cryptocurrency) for performing transactions or executing the code on Ethereum network. In fact it's a reward for the nodes who group transactions in blocks and validate them. You can specify how much gas you're willing to pay, and potentially incentivise validating nodes to verify your transaction sooner.\n\nAs a measure of protection against erroneous or malicious calculations (for example infinite loops), gas limit is specified for each transaction. Once the limit is reached and calculation is not complete, the transaction is cancelled. Gas price is however paid in full.\n\n### Ethereum Test networks\n\nBesides main Ethereum network, there are a few test networks that smart contract developers use to verify their code. Current test networks are:\n* [Ropsten] - default test network\n* [Rinkeby] - simplified test network with \"free\" Ether\n* [Kovan] - test network with a different consensus mechanism\n\n## Tokens\n\n### ERC20\n\n[ERC20] is one of the token standard interfaces. It is most commonly used when you use token as a coin - they don't have special properties, they're transfarrable and can be re-used by other applications, such as wallets, exchanges, or third party smart contracts.\n\nTo be compliant with ERC20, smart contract must implement this interface:\n```javascript\ncontract ERC20Interface {\n    function totalSupply() public constant returns (uint);\n    function balanceOf(address tokenOwner) public constant returns (uint balance);\n    function allowance(address tokenOwner, address spender) public constant returns (uint remaining);\n    function transfer(address to, uint tokens) public returns (bool success);\n    function approve(address spender, uint tokens) public returns (bool success);\n    function transferFrom(address from, address to, uint tokens) public returns (bool success);\n\n    event Transfer(address indexed from, address indexed to, uint tokens);\n    event Approval(address indexed tokenOwner, address indexed spender, uint tokens);\n}\n```\n\n## How to deploy your own token\n\n### MetaMask setup and free Rinkeby ether\n\n* Install and configure [MetaMask] in your favourite browser\n* Click on MetaMask button, switch the network to Rinkeby (at the top) and copy your address to clipboard\n* Go to [Rinkeby Faucet] and follow instructions to get Ether\n\n### Token creation\n\n* Download files from [OpenZeppelin] - an open source framework to build secure smart contracts on Ethereum:\n  * [Basic Token.sol]\n  * [ERC20.sol]\n  * [ERC20Basic.sol]\n  * [StandardToken.sol]\n  * [SafeMath.sol]\n* Open [Remix Solidity] - official Ethereum web IDE\n* Click on folder button in top-left corner and add all *.sol files you've downloaded\n* Click on BasicToken.sol and update SafeMath import path from: `import \"../../math/SafeMath.sol\";` to `import \"./SafeMath.sol\";` as all files are in the same directory\n* Click + in the top-left corner, create MyBestToken.sol and copy-paste the content below (based on [SimpleToken.sol]):\n\n```javascript\npragma solidity ^0.4.18;\n\nimport \"./StandardToken.sol\";\n\n/**\n * @title SimpleToken\n * @dev Very simple ERC20 Token example, where all tokens are pre-assigned to the creator.\n * Note they can later distribute these tokens as they wish using `transfer` and other\n * `StandardToken` functions.\n*/\ncontract MyBestToken is StandardToken {\n\n  string public constant name = \"MyBestToken\";\n  string public constant symbol = \"MBT\";\n  uint8 public constant decimals = 18;\n\n  uint256 public constant INITIAL_SUPPLY = 1000000000000000000000000 * (10 ** uint256(decimals));\n\n  /**\n   * @dev Constructor that gives msg.sender all of existing tokens.\n   */\n  function MyBestToken() public {\n    totalSupply_ = INITIAL_SUPPLY;\n    balances[msg.sender] = INITIAL_SUPPLY;\n    Transfer(0x0, msg.sender, INITIAL_SUPPLY); // Record event\n  }\n}\n```\n* Click \"Auto compile\" checkbox and then \"Start to compile\"\n* Go to Run tab on the right, select MyBestToken from dropdown menu and click on \"Create\"\n* MetaMask window should pop up to sign the transaction, click OK\n* Congratulations, you've created a token!\n\n### Add Token to MetaMask\n\n* Click on MetaMask and click on the contract creation in Sent tab\n* Copy contract address from To: field on Etherscan\n* In MetaMask click on Token tab and \"Add Token\"\n* Paste in the address\n* Token should now be visible to MetaMask\n\n\n[MetaMask]: https://metamask.io/\n[Ehtereum]: https://www.ethereum.org/ \n[Remix Solidity]: https://remix.ethereum.org/\n[OpenZeppelin]: https://github.com/OpenZeppelin/zeppelin-solidity\n[Kovan]: https://kovan-testnet.github.io/website/\n[Rinkeby]: https://www.rinkeby.io/\n[Rinkeby Faucet]: https://www.rinkeby.io/#faucet\n[Ropsten]: https://github.com/ethereum/ropsten\n[ERC20]: https://github.com/ethereum/EIPs/blob/master/EIPS/eip-20.md\n[SimpleToken.sol]: https://github.com/OpenZeppelin/zeppelin-solidity/blob/master/contracts/examples/SimpleToken.sol\n[Basic Token.sol]: https://raw.githubusercontent.com/OpenZeppelin/zeppelin-solidity/master/contracts/token/ERC20/BasicToken.sol\n[ERC20.sol]: https://raw.githubusercontent.com/OpenZeppelin/zeppelin-solidity/master/contracts/token/ERC20/ERC20.sol\n[ERC20Basic.sol]: https://raw.githubusercontent.com/OpenZeppelin/zeppelin-solidity/master/contracts/token/ERC20/ERC20Basic.sol\n[StandardToken.sol]: https://raw.githubusercontent.com/OpenZeppelin/zeppelin-solidity/master/contracts/token/ERC20/StandardToken.sol\n[SafeMath.sol]: https://raw.githubusercontent.com/OpenZeppelin/zeppelin-solidity/master/contracts/math/SafeMath.sol"}